# SetCellCombinedParameters Method (Int32, IList(TableCellCombinedParameterData))

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..SetCellCombinedParameters Method (Int32, IList<(Of <(<'TableCellCombinedParameterData>)>)>)
TableSectionData Class See Also
---
Allows the caller to set combined parameter for a specified column
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetCellCombinedParameters(
	int nCol,
	IList<TableCellCombinedParameterData> paramData
)
```

Visual Basic
---
```text
Public Sub SetCellCombinedParameters ( _
	nCol As Integer, _
	paramData As IList(Of TableCellCombinedParameterData) _
)
```

Visual C++
---
```text
public:
void SetCellCombinedParameters(
	int nCol,
	IList<TableCellCombinedParameterData^>^ paramData
)
```

# ### Parameters
nCol
    Type: System..::..Int32
paramData
    Type: System.Collections.Generic..::..IList<(Of <(<'TableCellCombinedParameterData>)>)>
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given column number nCol is invalid. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TableSectionData Class
SetCellCombinedParameters Overload
Autodesk.Revit.DB Namespace